; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl1)
	(at plane2 city2)
	(fuel-level plane2 fl2)
	(at plane3 city0)
	(fuel-level plane3 fl2)
	(at plane4 city2)
	(fuel-level plane4 fl6)
	(at plane5 city6)
	(fuel-level plane5 fl3)
	(at person1 city7)
	(at person2 city1)
	(at person3 city4)
	(at person4 city7)
	(at person5 city8)
	(at person6 city5)
	(at person7 city5)
	(at person8 city7)
	(at person9 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city9)
	(at person2 city5)
	(at person3 city5)
	(at person4 city11)
	(at person5 city2)
	(at person6 city9)
	(at person7 city3)
	(at person8 city2)
	(at person9 city5)
	))

)

; plan
1. (fly plane5 city6 city1 fl3 fl2)
   deleted: (at plane5 city6) (fuel-level plane5 fl3)
   added: (at plane5 city1) (fuel-level plane5 fl2)
   goals met: 0 of 9
2. (board person2 plane5 city1)
   deleted: (at person2 city1)
   added: (in person2 plane5)
   goals met: 0 of 9
3. (zoom plane5 city1 city5 fl2 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl2)
   added: (at plane5 city5) (fuel-level plane5 fl0)
   goals met: 0 of 9
4. (board person7 plane5 city5)
   deleted: (at person7 city5)
   added: (in person7 plane5)
   goals met: 0 of 9
5. (refuel plane5 city5 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 0 of 9
6. (board person6 plane5 city5)
   deleted: (at person6 city5)
   added: (in person6 plane5)
   goals met: 0 of 9
7. (debark person2 plane5 city5)
   deleted: (in person2 plane5)
   added: (at person2 city5)
   goals met: 1 of 9
8. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   goals met: 1 of 9
9. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   goals met: 1 of 9
10. (fly plane1 city4 city5 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 1 of 9
11. (debark person9 plane1 city5)
   deleted: (in person9 plane1)
   added: (at person9 city5)
   goals met: 2 of 9
12. (debark person3 plane1 city5)
   deleted: (in person3 plane1)
   added: (at person3 city5)
   goals met: 3 of 9
13. (fly plane5 city5 city3 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 3 of 9
14. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 3 of 9
15. (debark person7 plane5 city3)
   deleted: (in person7 plane5)
   added: (at person7 city3)
   goals met: 4 of 9
16. (fly plane5 city3 city9 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 4 of 9
17. (debark person6 plane5 city9)
   deleted: (in person6 plane5)
   added: (at person6 city9)
   goals met: 5 of 9
18. (zoom plane2 city2 city7 fl2 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl2)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 5 of 9
19. (board person8 plane2 city7)
   deleted: (at person8 city7)
   added: (in person8 plane2)
   goals met: 5 of 9
20. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 9
21. (board person4 plane2 city7)
   deleted: (at person4 city7)
   added: (in person4 plane2)
   goals met: 5 of 9
22. (board person1 plane2 city7)
   deleted: (at person1 city7)
   added: (in person1 plane2)
   goals met: 5 of 9
23. (zoom plane3 city0 city8 fl2 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl2)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 5 of 9
24. (board person5 plane3 city8)
   deleted: (at person5 city8)
   added: (in person5 plane3)
   goals met: 5 of 9
25. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 9
26. (fly plane3 city8 city2 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 5 of 9
27. (debark person5 plane3 city2)
   deleted: (in person5 plane3)
   added: (at person5 city2)
   goals met: 6 of 9
28. (fly plane2 city7 city11 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 6 of 9
29. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 9
30. (debark person4 plane2 city11)
   deleted: (in person4 plane2)
   added: (at person4 city11)
   goals met: 7 of 9
31. (fly plane2 city11 city2 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 7 of 9
32. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 9
33. (debark person8 plane2 city2)
   deleted: (in person8 plane2)
   added: (at person8 city2)
   goals met: 8 of 9
34. (fly plane2 city2 city9 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 8 of 9
35. (debark person1 plane2 city9)
   deleted: (in person1 plane2)
   added: (at person1 city9)
   goals met: 9 of 9
